Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.VoltageIsOutOfRange
Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)."

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.UnsignedCircuit
Circuit is not assigned to a panel

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.SmallBendRadius
The value you entered for the bend radius for conduit is too small. Enter a larger value.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.SelectedElementsArePartOfOtherCircuit
You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchCircuitType
Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ObjsDemolished
Cannot assign [Element] to circuit.  Objects that are demolished cannot be added to a circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotSupportConcentricBend
Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotPositiveBendRadius
The value you entered for the bend radius is zero or a negative value. Enter a positive value.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelPipes
Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelConduits
Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel
There are not enough slots available on panel: [Panel Name] for a circuit to be added.  Please increase the maximum number of single pole breakers to be greater than [Number] or set it to 0.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotAllowedCableTrayConduitRotation
Don't allow to rotate a horizontal cable tray/conduit like this

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NoAvailableMatchingConnector
Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MissingOrInvalidWireSizeTable
Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageToCircuit
Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageLineToLine
Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System).

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchPoleBrakesSlotsNumbers
The number of pole breakers may not be less than the number of occupied slots.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbOfPolesToCircuit
Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbAssignedDistSysToCircuit
Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchConnectorDistSysToCircuit
Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidPathOfParallelConduits
Invalid path of parallel conduits

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumwiresSinglephase
Invalid number of wires for single phase, only 2 and 3 are valid.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FamilyMismatchCircuit
The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ElementsBelongToOtherCircuit
You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ConduitModified
The conduit has been modified to be in the opposite direction or insufficient space to create the required fittings.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitOverload
Total connected load for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotRemoveMembersInCircuitHavingParent
You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotCreatePanelScheduleDuetoNoDefaultTemplate
A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotConnectDifferentDesignOptsObjects
Cannot add or assign [Element] to circuit.  Electrical objects belonging to different design options cannot be connected.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAssignSecondaryDistSysToCircuit
Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CableTrayModified
The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.BankDistanceSmallerThanDiameter
The distance value is smaller than the conduit diameter, please enter a larger value

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.AllSlotsOnPanelOccupied
All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures
Failures about Electricity.